parallel_plates_modified/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 0)      // 0
    (10 0 0)    // 1
    (10 1 0)   // 2
    (0 1 0)     // 3
    (0 0 0.1)    // 4
    (10 0 0.1)  // 5
    (10 1 0.1) // 6
    (0 1 0.1)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
   inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces ((0 4 7 3));
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces ((1 2 6 5));
    }
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
